Revit 2026 API

# FormatStatus Enumeration

---

An enumerated type indicating the formatting status of a range of characters in FormattedText

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum FormatStatus
```
```vb
Public Enumeration FormatStatus
```
```cpp
public enum class FormatStatus
```
```fsharp
type FormatStatus
```

| Member name | Value | Description |
| --- | --- | --- |
| All | 1 | All of the characters in the range have the specified format. |
| Mixed | 2 | The characters in the format have mixed formatting. |
| None | 0 | None of the characters in the range has the specified format. |

The character formatting includes

  * Bold
  * Italic
  * Underline
  * SuperScript
  * Subscript
  * All Caps

#### Reference

Autodesk.Revit.DB Namespace